[
  {
    "url": "https://nitkkr.ac.in/",
    "sections": [
      {
        "heading": "Admission-2025",
        "content": [
          "[A new begining]"
        ]
      },
      {
        "heading": "Innovation",
        "content": [
          "[Progress & Innovation]"
        ]
      },
      {
        "heading": "Convocation",
        "content": [
          "[Caps off to the future]"
        ]
      },
      {
        "heading": "Association",
        "content": [
          "[Connect with Alumni]"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/online-complaint/",
    "sections": [
      {
        "heading": "Online Complaint",
        "content": [
          "https://docs.google.com/forms/d/e/1FAIpQLSfsihCCLoPNnTgo8YzoIyTibkT54QNQM83YIXtbUzLHfByApg/viewform"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/health-center/",
    "sections": [
      {
        "heading": "Health Center",
        "content": [
          "HOSPITAL SERVICES:",
          "The multifarious medical needs of the Campus population consisting of Students, Staff members and members of their families are met by the Institute Health Centre. The Health Centre is headed by the Head (Hospital Services) with a team of Medical Officers and Para Medical staff. The Director has also constituted a Hospital Advisory Committee with a Chairman nominated by him and members drawn from hospital and other recognized bodies of the Institute with the Head (Hospital Services) as the Member Secretary of the Committee."
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/about-us-4/",
    "sections": [
      {
        "heading": "About Us",
        "content": [
          "HOSPITAL SERVICES:",
          "The multifarious medical needs of the campus population consisting of Students, Staff members and members of their families are met by the Institute Health Centre. The Health Centre is headed by the Head (Hospital Services) with a team of Medical Officers and Para Medical staff. The Director has also constituted a Hospital Advisory Committee with a Chairman nominated by him and members drawn from hospital and other recognized bodies of the institute, with the Head (Hospital Services) as the Member Secretary of the Committee.",
          "Prof. In-charge (Health Centre)\nProf. O.P. Sahu, Dept. of Electronics and Communication Engineering\nTel :+91-01744-233421 (O)",
          "Advisory Committee of Health Centre:\nChairman                    Dean (Students Welfare)\nMember                      Prof. In-charge (Health Centre)\nMember                      Senior Medical Officer\nMember Convener     Joint Registrar (GA)"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/?page_id=36036",
    "sections": [
      {
        "heading": "Medical Staff",
        "content": [
          "Medical Officer and Doctors",
          "Medical Staff"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/timings/",
    "sections": [
      {
        "heading": "Timings",
        "content": [
          "TIMINGS:"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/facilities/",
    "sections": [
      {
        "heading": "Facilities available at NIT HEALTH CENTRE",
        "content": [
          "(Timing: 9:00am to 1:00pm & 3:00pm to 8:30pm (5:30am to 8:30pm: emergency services))",
          "No investigation facility is available in emergency time period (5:30pm to 8:30pm)."
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/counsellor-facilities/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/swimming-pool/",
    "sections": [
      {
        "heading": "Swimming Pool",
        "content": [
          "Physical Education & Sports Section",
          "Home",
          "Welcome to the swimming pool of NIT Kurukshetra",
          "About the Swimming Pool",
          "NIT Kurukshetra now has a Swimming Pool of International Standards, 50 Mts. x 25 Mts. Size, with 90 Cm. depth at shallow end and 5 Mts. depth at deeper end. Apart from this it is equipped with Three Spring Boards for Diving   at 3 Mts., 5 Mts. and 7 Mts height simultaneously. It is provided with Anti-wave Lane markers to conduct competitions with Portable Take off Boards with Fiber of Olympic type where 60 to 70 people can be accommodated at a time.",
          "The swimming pool is operational during the months of March to October every year. The swimming pool has different timings for employees and students. The Institute team also has a different slot where they improve their skills and technique under the supervision of expert coaches.",
          "Location",
          "Who can become a Member?",
          "Swimming pool membership is open only to the following categories of persons.",
          "Bonafide students of NIT Kurukshetra, and research scholars and their spouse and children’s.\nNIT Kurukshetra employees (Faculty and staff) and their dependent family members (as per recorded in medical card or Health center booklet).\nAlumnus of NIT Kurukshetra.\nRetired Employees of NIT Kurukshetra and their spouses.\nAny other person specifically permitted by the Hon’ble Director.",
          "Anyone other than the above mentioned will be treated as outsider and will not be entitled to become member of the swimming pool.",
          "How to become a Member?",
          "All the members are requested to Fill-up the prescribed application form and submit it along with two photographs and copy of Identity card/Health card at the office of the Physical Education & Sports Section between 4:00PM and 5:30PM on any working day i.e. Monday to Friday.",
          "“Incomplete applications or the applications without proper Identity proof will not be entertained under any circumstance.”",
          "The format of membership application form, eligibility for membership, fees/subscription, timings and details are available on the Institute website www.nitkkr.ac.in > Section > Sports Section > Swimming Pool.",
          "Application Form Downloads:",
          "1. Membership Application for Students/Scholars (PDF)",
          "2. Membership Application for Employees (PDF)",
          "3. Membership Application for Employees Dependents (PDF)",
          "4. Membership_Application_special permission (1)",
          "Membership Subscription for the Session 2017",
          "Swimming Pool Administrative Bodies",
          "Professor In-charge (Physical Education)",
          "The swimming pool is an Institute facility operating under the Physical Education & Sports Section. The professor I/C (Physical education) is the head of the all sports activities and facilities.",
          "Presently the Physical Education & Sports Section is headed by Prof. Umesh Ghanker, Professor, Department of ECE.",
          "Swimming Pool Committee (SPC)",
          "A management committee appointed by the Hon’ble Director to make necessary recommendations for smooth running, maintenance and other activities time to time. The staff of the swimming pool will be directly control under the Prof. I/C physical education and swimming pool committee."
        ]
      },
      {
        "heading": "Duties and Responsibilities of the SPC",
        "content": [
          "To prepare the budget and lay down the policy guidelines for smooth running of the pool wards.\nTo decide about membership fees for different categories of users and charges for the guests of the members.\nTo decide about the dates of opening and closing of a swimming season.\nTo decide about pool timings and slots for swimming pool usage.\nTo formulate/revise conduct rules and guidelines for smooth running of the swimming pool.",
          "Present SPC"
        ]
      },
      {
        "heading": "The members of present SPC are:",
        "content": [
          "Manpower",
          "Day to Day Operation",
          "The following minimum numbers of personnel/manpower required for day to day operation and upkeep of swimming pool between 5:30 AM to 9.00 PM.",
          "Maintenance",
          "To carry out “maintenance of swimming pool” for the period of 4 Months by deploying following minimum numbers of personnel/manpower from 8:00 AM to 5.00 PM.",
          "Chemicals",
          "To maintain the quality of water in the swimming pool in accordance with applicable norms / license conditions with following minimum consumables:",
          "Guidelines",
          "Swimming pool timings will cover some designated periods between 5:30 AM and 9:00 PM only.\nThere will be several slots; each slot will be of 50 minutes in duration with a 5-10 minute gap between slots. Hence the members will be allowed in the pool on FIRST COME-FIRST-SERVE BASIS. The members should form a queue and get inside the pool in an orderly fashion.\nMaximum Number of swimmers in each slot shall be 50-60. This capacity may be increased in the future.\nThe Swimming Pool Committee will organize supervision of the pool.\nDiving is permitted in the Diving Area only under active supervision of an instructor. No person will enter the diving area except under advice of an instructor.\nThree lifeguards and two coaches will always be on duty during every slot.\nSwimmers and Learners shall be clearly distinguished and appropriately segregated. Learners must wear Red Bathing Caps.\nIn the event of power failure, or due to any other unforeseen circumstances, the pool may be closed or slots may be suspended / cancelled.\nThe swimming pool may be used for special events like Inter NIT, Inter Year or any other swimming competition decided by the Swimming pool committee, Physical Education & Sports Section or a higher authority. In such cases, the regular slots may either be changed or suspended during the competitions.\nThe pool management shall not be responsible for any theft, loss or damage of belongings of members. Members are advised not to bring mobile phones, cash, credit cards, jewelry etc. to the pool.\nWhile the management will try to provide some safety supervision, it cannot afford the standards necessary for a fully safe operation. Every member must strive to ensure his own safety and the safety of others around him.\nVisitors are not permitted to the deck area with or without shoes. They may, however, enter with shoes to the visitors’ gallery.\nUnauthorized entry into the swimming pool or any portion thereof, is a major offence, and attracts commensurate penalty.",
          "Conduct Rules",
          "Pool timings and slot given must be strictly adhered to by all members.\nMembers (including faculty and staff) will be allowed to enter the pool only after they have signed the register and handed over the Swimming Pool IDENTITY CARDS at the counter “till the issued the swimming pool Identity Cards”. No one will be allowed to enter the swimming pool without surrendering their Identity cards to the supervisor.\nAt the end of the slot period, members are required to sign the register again and collect back their membership cards.\nSince the swimming pool is being maintained by outside workers, all users (including faculty and staff members) must have a valid identity card to use the swimming pool. Otherwise entry into the swimming pool will be denied.\nThe pool and deck area must be fully vacated in the interval between two slots or when an emergency call is given by the instructor.\nChildren below 4 years of age are not allowed in the swimming pool.\nNo child below the age between 4 to 12 years will be allowed inside the swimming pool unaccompanied by its parents. The parents are solely responsible for the safety of such young children inside the pool premises.\nProper swimming TRUNKS/COSTUMES and CAP must be worn during swimming. Ladies, girls and men having long hair, whether swimmer or learner, must use plastic bathing caps during swimming. Decision of instructor is final in deciding whether a particular costume is proper.\nLearners must wear RED BATHING CAP, fabric for men and boys, plastic for women, girls and men with long hair.\nLearners are not permitted in the deep end of the pool, i.e. beyond 20m from the shallow end. A learner may qualify as a swimmer only after clearing a test offered by an instructor.\nDuring certain designated slots, members should swim lengthwise to avoid collision with other swimmers.\nMembers must have urination and a shower followed by a footbath at the door of the shower room before entering the pool.\nUse of oil before entering the swimming pool is strictly prohibited.\nUse of soap or any other chemical is strictly prohibited in the swimming pool.\nPlaying, jumping, quarreling or any distracting behavior in the swimming pool is strictly prohibited.\nSmoking, drinking and consumption of eatables are strictly forbidden in the swimming pool premises.\nDo not dive into the pool where the depth is less than 5 feet.\nAvoid spitting or blowing the nose in the water, use the scum-gutter.\nPets are not permitted in the swimming pool premises.\nPool management is not responsible for thief, loss or damage of belongings.\nNo photography is allowed in the pool premises except when a written permission has been obtained from the Chairman, Swimming Pool Management Committee.\nIf a member suffers from a skin ailment, a chest, ENT or eye infection, an open wound or any medical condition that is unhealthy for him/her or for fellow swimmers, he/she should voluntarily refrain from using the pool till such time that the medical condition is corrected.\nLadies should not use the swimming pool during the menstrual period.\nDo not stay in the pool when there is lighting in the sky.\nDo not swim with full stomach of food.\nThose who do not know swimming must confine themselves to the less deep parts of the pool.\nInstructions of instructor or lifeguards on duty will be the final word at the pool. Membership of those not obeying instructions of the lifeguards on duty will be cancelled.\nClear the pool when asked to vacate the pool when the supervisor whistles.\nFor complaints and suggestions, please contact Chairman, Swimming Pool Management Committee. Never argue with a pool staff. These principles are imposed only for your safety and comfort.",
          "SAFETY",
          "Even though the pool may look perfectly safe, the swimmers are advised to exercise extreme caution while swimming. The swimmers should not swim if they develop muscle cramps or feel faint. Users having heart problems must get medical opinion before swimming. Also, swimmers must do warm up exercise before entering the pool.\nIf you find anybody struggling or sinking in the swimming pool, never jump into the water to save him/her, Instead, immediately throw one of the ring buoys available on the side of the swimming pool to the swimmer in distress. Then inform one of the lifeguards on duty.",
          "Events",
          "Roadmap"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/computer-engg/",
    "sections": [
      {
        "heading": "Computer Engineering",
        "content": [
          "About Us",
          "The department started offering B.Tech. Programme in Computer Engineering in 1987 with initial intake of 30 students and subsequently raised to 210. Department also started B.Tech programme in Information Technology (IT) in 2006 with present intake of 140 students.",
          "Department of Computer Engineering is offering a new undergraduate program from the 2023-24 academic session in Artificial Intelligence & Machine Learning (AI & ML) with an intake of 60.",
          "The curriculum of the B.Tech. program in AI&ML emphasizes the foundations of computational mathematics as well as key areas of computer science, while also incorporating fundamental concepts and the latest advancements in artificial intelligence, data science and machine learning. By offering core courses in computer science and engineering, the program equips students with the necessary skills to navigate the dynamic landscape of IT requirements preparing for the future.",
          "The department is proud to have a record of almost 100% placement for last 10 years. The department also offers two M.Tech. programs, one in Computer Engineering and other in Cyber Security. Department started Ph.D. program in 2002. So far 44 Ph.D.s have been awarded and 28 PhDs are in progress. Currently there are five sponsored projects undergoing in the department.",
          "Faculty of the department have specialized areas for advanced studies and research in Distributed Computing, Software Engineering, Computer Networks, Database and Data Mining, Natural Language Processing, Information and Cyber Security, Image Processing.",
          "The department is well equipped with state-of-the-art laboratories of all major domains of Computer Engineering and Information Technology with excellent intranet, servers, hardware and software support.",
          "Each year, many students of the department get selected for higher studies in world’s most reputed Universities and Institutes. The department is equally active in research with many quality publications each year in IEEE, Sciencedirect, ACM, Springer, Wiley etc. For the overall development we also cover the other aspects of life like Health management, moral and ethical development of the students.",
          "The Department’s UG programs B. Tech Computer Engineering and Information Technology are NBA Accredited  from Academic Year upto 2022-23"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/about-us/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/faculty/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/ug-computer/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/electrical-engg/",
    "sections": [
      {
        "heading": "INSTITUTE – INDUSTRY COLLABORATION",
        "content": [
          "ECE Department has an MOU with HEWLETT PACKARD INDIA SOFTWARE OPERATION PVT. LIMITED, 29 CUNNINGNAM ROAD, BANGALORE-52. Under this MOU, B.Tech final year students are allocated live Projects from HEWLETT PACKARD and jointly monitored by their faculty and those from NIT Kurukshetra.\nThe Institute offers consultancy services on the design and development problems referred to it by various Govt. and other Industrial Organizations.\nTEQIP efforts for Institute- Industry interaction is being attempted to be increased. The Institute organised a two-day workshop on Industry Institute interaction (NWIII-2007) on Feburary 19-20, 2007 at Hotel Shiwalikview Chandigarh, which was largely attended by the leading industry and academia. During the deliberations of the workshop it was agreed upon to enter for a Memorandum of understanding between NIT Kurukshetra and Altair Engineering India regarding setting up of a center of excellence in the field of computer Aided Engineering (CAE) at NIT Kurukshetra for mutual benefits."
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/chemistry/",
    "sections": [
      {
        "heading": "Chemistry",
        "content": [
          "DEPARTMENT OF CHEMISTRY",
          "MESSAGE:",
          "It is my pleasure to communicate this message about Department of Chemistry, National Institute of Technology Kurukshetra. The Department of Chemistry started in 1963 and is one of the oldest departments of the institute. Chemistry is basically all about knowing and investigating the structures and reactions of substances of matter and covers an important part of science that bridges many aspects of other sciences, physical and biological, opening a door to many technological developments. Over the years, the Department has done high-profile research in a variety of areas, including coordination, analytical, bioinorganic, supramolecular, computational, organometallic, materials, organic, and polymer chemistry. The results of many of these research endeavours have been published in national and international journals of repute. The faculty also offers consultancy services to chemical industries in the region.",
          "Vision:",
          "Provide a comprehensive, relevant curriculum to all branches of  B.Tech., M.Tech. & Ph.D. in Chemistry\nPromoting the collegial exchange of ideas, independent thoughts, and the highest ethical standards.\nProduce knowledgeable Graduates; post graduates  and Doctoral students for careers in academia, industries and government organizations\npromoting a diverse population of faculty, staff and students\nconducting  significant research in Chemistry",
          "Mission:",
          "Independent thoughts, collegial exchange of ideas and high ethical standards\nFrequent interactions between faculty and students and Use of modern educational technology in lecture and laboratory courses\nDevelopment of innovative instructional techniques",
          "Undergraduate Courses:",
          "The department offers two compulsory courses in Chemistry as an integral part of the curriculum of engineering degree courses in the first and second semesters. Emphasis is laid on the basic principles of chemistry and their applications in engineering disciplines. The department also offers electives to students of 7th and 8th semesters.",
          "Courses Offered:",
          "Equipments Available:",
          "UV/visible Diode Array Spectrophotometer\nCHNS/O Elemental Analyzer\nFT-IR Spectrophotometer\nHigh Precision Electronic Balances\nFluorescent Spectrophotometer\nHigh Vacuum Rotatory Evaporator\nDigital Melting Point Apparatus\nIon-selective Electrode pH Meter\nRotatory Shaker",
          "Laboratory Facilities:",
          "Engineering Chemistry Laboratory for UG Students\nInstrumentation Laboratory for UG & Research Students\nResearch Laboratories",
          "Research Facilities:",
          "Research facilities leading to the degree of Doctor of Philosophy exist in the department. At present , members of the staff are engaged in research in the following fields:",
          "Bio-inorganic chemistry\nCoordination chemistry\nMacrocyclic chemistry\nPolymer anchored coordination chemistry\nSynthesis of heterocycles of medicinal interest\nFlourescent and chemo sensors\nDevelopment and industrial uses of photostabilizers, thermostabilizers for various polymeric materials\nBiomimetic compounds\nSynthesis of nanomaterials"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/faculty-1/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/scheme-syllabi-3/",
    "sections": [
      {
        "heading": "Scheme & Syllabi",
        "content": [
          "CHEMISTRY B.TECH SYLLABUS",
          "CHEMISTRY M.TECH SYLLABUS"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/academic-notifications/",
    "sections": [
      {
        "heading": "Acad. Notices",
        "content": [
          "General Notifications"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/exam-notifications/",
    "sections": [
      {
        "heading": "Exam Notifications",
        "content": [
          "Exam Notifications"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/result-notification/",
    "sections": [
      {
        "heading": "Result Notification",
        "content": [
          "Result Notifications"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/exam-date-sheet/",
    "sections": [
      {
        "heading": "Exam Date Sheet",
        "content": [
          "Theory/Practical Examination"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/institute-time-table/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/academic-calender/",
    "sections": [
      {
        "heading": "Academic Calendar",
        "content": [
          "Session 2024-25",
          "Session 2023-24",
          "Click here to browse the archived Academic calendars."
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/scheme/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/roll-sheets/",
    "sections": []
  },
  
  
  {
    "url": "https://nitkkr.ac.in/mtech-first-year/",
    "sections": [
      {
        "heading": "M.Tech. [1st Year]",
        "content": [
          "Provisional Roll Sheet M.Tech. 2nd Sem. Open Elective (A.Y.2024-25)",
          "M.Tech. 1st Year 2nd Semester (SVDE)\nM.Tech. 1st Year 2nd Semester Computer Engg\nM.Tech. 1st Year 2nd Semester (SREE)\nM.Tech. 1st Year 2nd Semester (Electrical Engg.)\nM.Tech. 1st Year 2nd Semester (Mechanial Engg.)\nM.Tech. 1st Year 2nd Semester (Civil Engg.)\nM.Tech. 1st Year 2nd Semester (Physics)\nM.Tech. 1st Year 2nd Semester (ECE)",
          "Revised Provisional Roll Sheet of M.Tech. 1st Year 1st Semester (Civil Engg.) Odd Semester (A.Y. 2024-25)",
          "M.Tech. 1st Year 1st Semester (Computer Engg.)\nM.Tech. 1st Year 1st Semester (ECE)\nM.Tech. 1st Year 1st Semester (Electrical Engg.\nM.Tech. 1st Year 1st Semester (Mechanical Engg.)\nM.Tech. 1st Year 1st Semester (Physics)\nM.Tech. 1st Year 1st Semester (SREE.)\nM.Tech.1st Year 1st Semester (SVDES)",
          "Provisional Roll sheet of MTech,  Odd Semester, AY. 2023-24",
          "M.Tech. 2nd Year 3rd Semester SVDES\nM.Tech. 2nd Year 3rd Semester Physics\nM.Tech. 2nd Year 3rd Semester SREE\nM.Tech 2nd Year 3rd Semester Electrical Engg.\nM.Tech. 2nd Year 3rd Semester Mechanical Engg.\nM.Tech. 2nd Year 3rd Semester ECE\nM.Tech. 2nd Year 3rd Semester Civil Engg.\nM.Tech. 2nd Year 3rd Semester Computer Engg.\nProvisional Roll sheet of MTech,  Odd Semester, AY. 2023-24\nM.Tech. 1st Year 1st Semester Computer Engg.\nM.Tech. 1st Year 1st Semester Electrical Engg.\nM.Tech. 1st Year 1st Semester ECE\nM.Tech. 1st Year 1st Semester Mechanical Engg.\nM.Tech. 1st Year 1st Semester Civil Engg. Deptt.\nM.Tech. 1st Year 1st Semester SVDES\nM.Tech. 1st Year 1st Semester Physics Deptt.\nM.Tech. 1st Year 1st Semester SREE\nProvisional Roll Sheet of M.Tech. 1st Year 1st Semester (A.Y. 2023-24)\nM.Tech. 1st Year 1st Semester SVDES\nM.Tech. 1st Year 1st Semester Physics\nM.Tech. 1st Year 1st Semester SREE\nM.Tech. 1st Year 1st Semester ECE\nM.Tech. 1st Year 1st Semester Mechanical Engg.\nM.Tech. 1st Year 1st Semester Computer Engg.\nM.Tech. 1st Year 1st Semester Civil Engg.\nM.Tech. 1st Year 1st Semester Electrical Engg.\nM.Tech. 1st Year 2nd Semester Mechanical Engg.\nM.Tech. 1st Year 2nd Semester Physics\nM.Tech. 1st Year 2nd Semester SREE\nM.Tech. 1st Year 2nd Semester Embedded\nM.Tech. 1st Year 2nd Semester Computer Engg.\nM.Tech. 1st Year 2nd Semester ECE\nM.Tech. 1st Year 2nd Semester Civil Engg.\nM.Tech. 1st Year 2nd Semester Electrical Engg.\nRevised Provisional Roll Sheet M.Tech. Open Elective (2022 Batch) 2nd Semester 2022-23\nProvisional Roll Sheet of M.Tech.2nd Year 4th Semester (A.Y. 2022-23)\nM.Tech. 2nd Year 4th Semester Civil Engg.\nM.Tech. 2nd year 4th Semester Computer Engg\nM.Tech. 2nd year 4th Semester ECE\nM.Tech. 2nd year 4th Semester Electrical Engg.\nM.Tech. 2nd year 4th Semester Mechanical Engg.\nM.Tech. 2nd year 4th Semester Physics\nM.Tech. 2nd year 4th Semester SREE\nM.Tech. 2nd year 4th Semester SVDES\nProvisional Roll Sheet of M.Tech.1st Year 2nd Semester (A.Y. 2022-23):-\nM.Tech. 1st Year 2nd Semester Civil Engg.\nM.Tech. 1st Year 2nd Semester Computer Engg.\nM.Tech. 1st Year 2nd Semester ECE\nM.Tech. 1st Year 2nd Semester Electrical Engg.\nM.Tech. 1st Year 2nd Semester Mechanical Engg.\nM.Tech. 1st Year 2nd Semester Physics\nM.Tech. 1st Year 2nd Semester SREE\nM.Tech. 1st Year 2nd Semester SVDES",
          "Roll Sheet M.Tech. Open Elective (2022 Batch) 2nd Semester 2022-23",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM Mechanical",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM Electrical",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM ALL SPECIALIZATIONS AY 2022-23",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM Computer Engg",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM Civil Engg. Deptt",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM Electronics Comm",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM Physics",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM Renewal Energy",
          "Roll Sheet M.Tech. 1ST YEAR 1ST SEM Embedded System",
          "20-08-2022 Roll Sheet M.Tech. 1ST YEAR 1ST SEM ALL SPECIALIZATIONS AY 2022-23",
          "M.Tech 1year 2nd Semester Academic Year 2021-2022",
          "M.Tech. 1st year 2nd Sem Civil Engg. Deptt 21",
          "M.Tech. 1st year 2nd Sem Computer Engg 21",
          "M.Tech. 1st year 2nd Sem Electrical 21",
          "M.Tech. 1st year 2nd Sem Electronics Comm 21",
          "M.Tech. 1st year 2nd Sem Embedded System 21",
          "M.Tech. 1st year 2nd Sem Mechanical 21",
          "M.Tech. 1st year 2nd Sem Renewal Energy 21",
          "M.Tech. 1st year 2nd Sem Physics 21",
          "Roll Sheet M.Tech. 2nd Sem. Open Elective 2021-22",
          "08-01-2022 M.Tech 2nd Semester Academic Year 2021-2022",
          "M.Tech. 1st year 2nd Sem Physics 21",
          "M.Tech. 1st year 2nd Sem Electronics Comm 21",
          "M.Tech. 1st year 2nd Sem Computer Engg 21",
          "M.Tech. 1st year 2nd Sem Renewal Energy 21",
          "M.Tech. 1st year 2nd Sem Electrical 21",
          "M.Tech. 1st year 2nd Sem Civil Engg. Deptt 21",
          "M.Tech. 1st year 2nd Sem Mechanical 21",
          "23-09-2021 M.Tech 1st Semester Academic Year 2021-2022",
          "M.Tech. 1st year 1st Sem Civil Engg. Deptt 21",
          "M.Tech. 1st year 1st Sem Electrical 21",
          "M.Tech. 1st year 1st Sem Electronics Comm 21",
          "M.Tech. 1st year 1st Sem Embedded System 21",
          "M.Tech. 1st year 1st Sem Mechanical 21",
          "M.Tech. 1st year 1st Sem Physics 21",
          "M.Tech. 1st year 1st Sem Renewal Energy 21",
          "M.Tech. 1st year 1st Sem Computer Engg 21",
          "31-08-2021 M.Tech 1st Semester Academic Year 2021-2022",
          "M.Tech. 1st year 1st Sem Physics 21",
          "M.Tech. 1st year 1st Sem Electronics Comm 21",
          "M.Tech. 1st year 1st Sem Mechanical 21",
          "M.Tech. 1st year 1st Sem Renewal Energy",
          "M.Tech. 1st year 1st Sem Electrical 21",
          "M.Tech. 1st year 1st Sem Civil Engg. Deptt 21",
          "M.Tech. 1st year 1st Sem Computer Engg 21",
          "M.Tech. 1st year 1st Sem Embedded System 21",
          "20-01-2021 Revised Roll Sheet of M.Tech Open Elective Course Code MEE1O82 (Reliability Engineering) for Even Semester",
          "12-01-2021 Revised Roll Sheet of M.Tech. Open Elective for Even Semester 2020-21",
          "08.01.2021:  Roll-Sheet of M.Tech (Open Elective) 2020 Batch 2nd Semester 1st Year 2020-21",
          "17-09-2020  M.Tech 1st Sem",
          "Roll Sheet M.Tech. 1st Year 1st SEM Computer Engg",
          "Roll Sheet M.Tech. 1st Year 1st SEM Civil Engg. Deptt",
          "Roll Sheet M.Tech. 1st Year 1st SEM Electrical",
          "Roll Sheet M.Tech. 1st Year 1st SEM Electronics Comm",
          "Roll Sheet M.Tech. 1st Year 1st SEM Embedded System. odd SEM",
          "Roll Sheet M.Tech. 1st Year 1st SEM Mechanical",
          "Roll Sheet M.Tech. 1st Year 1st SEM Physics",
          "Roll Sheet M.Tech. 1st Year 1st SEM Renewal Energy",
          "06-01-2020  M.Tech 2nd Sem  Even Semester",
          "M.Tech. 1st year 2ND SEM Computer Engg 2019_20",
          "M.Tech. 1st year 2ND SEM Civil Engg. Deptt 2019_20",
          "M.Tech. 1st year 2ND SEM Electrical 2019_20",
          "M.Tech. 1st year 2ND SEM Electronics Comm 2019_20",
          "M.Tech. 1st year 2ND SEM Embedded System 2019_20",
          "M.Tech. 1st Year 2ND SEM M S N (Physics) 2019_20",
          "M.Tech. 1st year 2ND SEM Mechanical 2019_20",
          "M.Tech. 1st year 2ND SEM Physics 2019_20",
          "M.Tech. 1st year 2ND SEM Renewal Energy 2019_20",
          "30-08-2019 M.Tech 1st Sem Final Roll Sheet 1st Year",
          "30-08-2019 M.Tech. 1st year Renewal_Energy_odd Sem19",
          "30-08-2019 M.Tech. 1st year Physics_odd Sem_19",
          "30-08-2019 M.Tech. 1st Year M S N_(Physics)_odd Sem 19",
          "30-08-2019 M.Tech. 1st year Mechanical_odd Sem_19",
          "30-08-2019 M.Tech. 1st year_Embedded System._odd_Sem 19",
          "30-08-2019 M.Tech. 1st year_Electrical odd_Sem19",
          "30-08-2019 M.Tech. 1st year Electronics Comm._odd_Sem 19",
          "30-08-2019 M.Tech. 1st year Computer Engg_odd Sem19",
          "30-08-2019 M.Tech. 1st year Civil Engg. Deptt odd_Sem19",
          "02-08-2019 M.Tech 1st Sem Provisional Roll Sheet 1st Year",
          "M.Tech. 1st year_Civil Engg. Deptt odd Sem_19",
          "M.Tech. 1st year_Embedded System. odd Sem_19",
          "M.Tech. 1st year_Electronics Comm._odd Sem 19",
          "M.Tech. 1st year_Computer Engg odd_Sem 19",
          "M.Tech. 1st year_Electrical odd Sem_19",
          "M.Tech. 1st Year_M S N (Physics) odd_Sem 19",
          "M.Tech. 1st year_Mechanical_odd Sem 19",
          "M.Tech. 1st year_Physics odd_Sem 19",
          "M.Tech. 1st year_Renewal Energy_odd Sem 19",
          "25-07-2019 M.Tech 1st Sem Provisional Roll Sheet Odd Semester 2019-20",
          "M.Tech. 1st year Civil Engg. Deptt_odd Sem 19",
          "M.Tech. 1st year_Electrical odd Sem 19",
          "M.Tech. 1st year Electronics_Comm. odd Sem 19",
          "M.Tech._1st year Embedded System. odd Sem 19",
          "M.Tech. 1st year Computer Engg odd Sem_19",
          "M.Tech. 1st Year M S N odd_Sem 19",
          "M.Tech. 1st year Renewal_Energy odd Sem 19",
          "M.Tech. 1st year Physics_odd Sem 19",
          "M.Tech. 1st year_Mechanical odd Sem 19",
          "26-02-2019 Final M.Tech 2nd Sem 2018-19 Even Semester",
          "Final Roll Sheet M.Tech. 2nd sem chemistry (Molecular) EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem Civil Engg. Deptt EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem Computer Engg EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem Electrical EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem Electronics Comm. EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem Embedded System. EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem M S T EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem Mechanical EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem Physics EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd sem Renewal Energy EVEN SEM 2018-19",
          "Final Roll Sheet M.Tech. 2nd_sem Boimedical EVEN SEM 2018-19",
          "22-12-2018 M.Tech 2nd Sem 2018-19 Even Semester",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "04-09-2018 M.Tech Sem 2018-19 Updated",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "01-09-2018 M.Tech Sem 2018-19",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "30-07-2018 M.Tech Sem 2018-19",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "28-12-2017 M.Tech 1st Year 2nd Sem",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "01-09-2017 Final Roll sheet Odd Sem. 2017-18",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "27-07-2017 Roll sheet Odd Sem. 2017-18",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "19-12-16: Roll sheet Even Sem. 2016-17",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "29-09-16: Final Roll sheet Odd Sem. 2016-17",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "27-07-16: Roll sheet Odd Sem. 2016-17",
          "M.S.N\nBiomedical\nChemistry\nCivil\nComputers\nElectrical\nElectronics Communications\nEmbedded\nMechanical\nPhysics\nRenewal Energy",
          "Final ROLL SHEET EVEN SEM FOR M.TECH 2015-16",
          "Civil Engineering\nMechanical Engineering\nComputer Engineering\nElectrical Engineering\nElectronics & Communication Engineering\nPhysics Department\nChemistry Department\nSchool of VLSI Design & Embedded System\nSchool of Renewal Energy & Efficiency\nSchool of Bio Medical Engineering",
          "ROLL SHEET ODD SEMESTER FOR M.TECH 2015-16",
          "Civil Engineering\nMechanical Engineering\nComputer Engineering\nElectrical Engineering\nElectronics & Communication Engineering\nPhysics Department\nChemistry Department\nSchool of VLSI Design & Embedded System\nSchool of Renewal Energy & Efficiency\nSchool of Material Science & Nano Technology\nSchool of Bio Medical Engineering",
          "FINAL ROLL SHEET FOR M.TECH  2ND SEM SESSION 2014-15(EVEN SEM) [W.E.F. 28.04.15]",
          "Civil Engineering\nMechanical Engineering\nComputer Engineering\nElectronics & Communication Engineering\nPhysics Department\nSchool of VLSI Design & Embedded System\nSchool of Renewal Energy & Efficiency\nSchool of Material Science & Nano Technology\nSchool of Bio Medical Engineering"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/mtech-second-year/",
    "sections": [
      {
        "heading": "M.Tech. [2nd Year]",
        "content": [
          "M.Tech. 2nd Year 3rd Semester SVDES\nM.Tech. 2nd Year 3rd Semester Physics\nM.Tech. 2nd Year 3rd Semester SREE\nM.Tech 2nd Year 3rd Semester Electrical Engg.\nM.Tech. 2nd Year 3rd Semester Mechanical Engg.\nM.Tech. 2nd Year 3rd Semester ECE\nM.Tech. 2nd Year 3rd Semester Civil Engg.\nM.Tech. 2nd Year 3rd Semester Computer Engg.\nFinal Roll Sheet of M.Tech. 2nd Year 4th Semester (A.Y. 2022-23) \nM.Tech. 2nd year 4th Semester Physics\nM.Tech. 2nd year 4th Semester SREE\nM.Tech. 2nd year 4th Semester Mechanical Engg.\nM.Tech. 2nd year 4th Semester Embedded System\nM.Tech. 2nd Year 4th Semester Civil Engg.\nM.Tech. 2nd year 4th Semester ECE\nM.Tech. 2nd year 4th Semester Computer Engg\nM.Tech. 2nd year 4th Semester Electrical Engg.\n Provisional Roll Sheet of M.Tech.2nd Year 4th Semester (A.Y. 2022-23):M.Tech. 2nd Year 4th Semester Civil Engg.M.Tech. 2nd year 4th Semester Computer EnggM.Tech. 2nd year 4th Semester ECEM.Tech. 2nd year 4th Semester Electrical Engg.M.Tech. 2nd year 4th Semester Mechanical Engg.M.Tech. 2nd year 4th Semester PhysicsM.Tech. 2nd year 4th Semester SREEM.Tech. 2nd year 4th Semester SVDES\n\nRoll Sheets of M.TECH 2ND Year 3rdSem for AY 2022-23 (Odd Semester)\n\nM.Tech. 2nd year 3rd Sem Civil Engg. Deptt 22 \n\nM.Tech. 2nd year 3rd Sem Computer Engg 22 \n\nM.Tech. 2nd year 3rd Sem Electronics Comm 22\n\nM.Tech. 2nd year 3rd Sem Electrical 22 \n\nM.Tech. 2nd year 3rd Sem Embedded System 22 \n\nM.Tech. 2nd year 3rd Sem Mechanical 22 \n\nM.Tech. 2nd year 3rd Sem Physics 22 \n\nM.Tech. 2nd year 3rd Sem Renewal Energy 22 \n\nRoll Sheet M.Tech. 2nd Year 4th SEM Civil Engg. Deptt\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Computer Engg-\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Electrical-\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Electronics Comm-\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Embedded System-\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Mechanical-\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Physics-\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Renewal Energy-\n\n10-01-2022 Roll Sheets of M.TECH 2ND Year 4th Sem for AY 2021-22 (Even Semester)\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Electronics Comm\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Renewal Energy \n\nRoll Sheet M.Tech. 2nd Year 4th SEM Computer Engg \n\nRoll Sheet M.Tech. 2nd Year 4th SEM Physics \n\nRoll Sheet M.Tech. 2nd Year 4th SEM Mechanical \n\nRoll Sheet M.Tech. 2nd Year 4th SEM Embedded System\n\nRoll Sheet M.Tech. 2nd Year 4th SEM Electrical \n\nRoll Sheet M.Tech. 2nd Year 4th SEM Civil Engg. Deptt \n\n22-07-2021 Roll Sheets of M.TECH 2ND Year 3th Sem for AY 2021-22 (Odd Semester)\n\nRoll Sheet M.Tech. 2nd Year 3rd SEM Electronics Comm\n\nRoll Sheet M.Tech. 2nd Year 3rd SEM Renewal Energy\n\nRoll Sheet M.Tech. 2nd Year 3rd SEM Computer Engg\n\nRoll Sheet M.Tech. 2nd Year 3rd SEM Physics\n\nRoll Sheet M.Tech. 2nd Year 3rd SEM Mechanical\n\nRoll Sheet M.Tech. 2nd Year 3rd SEM Embedded System. odd SEM\n\nRoll Sheet M.Tech. 2nd Year 3rd SEM Electrical\n\nRoll Sheet M.Tech. 2nd Year 3rd SEM Civil Engg. Deptt\n\n08-01-2021 Roll Sheets of M.TECH 2ND Year 4th Sem for AY 2020-21 (Even Semester)\n\nM.Tech. 2nd year 4th Sem Civil Engg. Deptt 20\n\nM.Tech. 2nd year 4th sem Computer Engg\n\nM.Tech. 2nd year 4th SEM Electrical\n\nM.Tech. 2nd year 4th SEM Electronics Comm\n\nM.Tech. 2nd year 4th SEM Embedded System 20\n\nM.Tech. 2nd year 4th SEM M S N (Physics) 20\n\nM.Tech. 2nd year 4th SEM Mechanical 20\n\nM.Tech. 2nd year 4th SEM Physics\n\nM.Tech. 2nd year 4th SEM Renewal Energy\n\n18-08-2020  Final M.Tech 2nd Year Odd Semester\n\nM.Tech. 2nd year 3rd SEM Civil Engg. Deptt\n\nM.Tech. 2nd year 3rd SEM Computer Engg \n\nM.Tech. 2nd year 3rd SEM Electrical \n\nM.Tech. 2nd year 3rd SEM Electronics Comm \n\nM.Tech. 2nd year 3rd SEM Embedded System \n\nM.Tech. 2nd year 3rd SEM M S N (Physics) \n\nM.Tech. 2nd year 3rd SEM Mechanical \n\nM.Tech. 2nd year 3rd SEM Physics \n\nM.Tech. 2nd year 3rd SEM Renewal Energy \n\n06-01-2020  Final M.Tech 2nd Year Even Semester\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Boimedical 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM chemistry (Molecular) 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Civil Engg. Deptt 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Computer Engg 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Electrical 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Electronics Comm. 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Embedded System. odd SEM 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM M S T 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Mechanical 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Physics 2019_20\n\nRoll Sheet M.Tech. 2nd Year 4TH SEM Renewal Energy 2019_20\n\n30-08-2019 Roll Sheet M.Tech 2nd Year\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Renewal Energy odd_SEM 2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Physics_odd SEM 2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Mechanical_odd SEM 2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year M S T_odd SEM 2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Embedded System. odd SEM_2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Electronics Comm. odd_SEM 2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Civil Engg. Deptt_odd SEM 2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Electrical odd SEM_2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Computer Engg odd SEM_2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year chemistry (Molecular)_odd SEM 2019_20\n\n30-08-2019 Roll Sheet M.Tech. 2nd Year Boimedical_odd SEM2019_20\n\n23-07-2019 Provissonal Roll Sheet M.Tech 2nd Year\n\nRoll Sheet M.Tech. 2nd Year Boimedical odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year chemistry (Molecular) odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year Computer Engg odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year Electrical odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year Civil Engg. Deptt odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year Electronics Comm. odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year M S T odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year Embedded System. odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year Mechanical odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year Physics odd SEM 2019-20\n\nRoll Sheet M.Tech. 2nd Year Renewal Energy odd SEM 2019-20\n\n22-12-2018 Final M.Tech 2nd Year Even Semester\n\nM.Tech. 2nd year Boimedical Even_Sem_18\n\nM.Tech. 2ND year chemistry_EVEN_Sem (Molecular) 18\n\nM.Tech. 2ND year Civil Engg. Deptt_EVEN Sem 18\n\nM.Tech. 2ND year Computer Engg_EVEN Sem 18\n\nM.Tech. 2nd year Electrical EVEN_Sem 18\n\nM.Tech. 2nd year Electronics_Comm. EVEN Sem 18\n\nM.Tech. 2nd year Embedded System. EVEN_Sem 18\n\nM.Tech. 2nd Year M S N EVEN Sem_18\n\nM.Tech. 2nd year Mechanical EVEN_Sem 18\n\nM.Tech. 2nd year Physics EVEN Sem_18\n\nM.Tech. 2nd year Renewal_Energy_EVEN Sem 18\n\n22-12-2018 M.Tech 2nd Year Even Semester\n\nPhysics\nCivil\nComputers\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\n01-09-2018 M.Tech 2nd Year 3rd Sem\n\nPhysics\nCivil\nComputers\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\n26-07-2018 M.Tech 2nd Year 3rd Sem\n\nPhysics\nCivil\nComputers\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\n28-12-2017 M.Tech 2nd Year 4th Sem\n\nPhysics\nCivil\nComputers\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\n01-09-2017 Final Roll Sheet 3rd Sem 2017-18 \n\nPhysics\nCivil\nComputers\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\n26-07-2017 Final Roll Sheet 3rd Sem 2017-18 \n\nPhysics\nCivil\nComputers\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\n19-12-16: Roll sheet Even Sem. 2016-17\n\nPhysics\nCivil\nComputers\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\n29-09-16: Final Roll Sheet 3rd Sem 2016-17\n\nPhysics\nCivil \nComputer\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\n13-07-16: M.Tech. 2nd  year 3rd  sem\n\nPhysics\nCivil \nComputer\nMechanical\nRenewal\nElectrical\nBiomedical\nChemistry\nECE\nEmbedded\nMSN\n\n \n\nFINAL ROLL SHEET ODD SEMESTER FOR M.TECH 2ND YEAR SESSION 2015-16\n\nCivil Engineering\nMechanical Engineering\nComputer Engineering\nElectrical Engineering\nElectronics & Communication Engineering\nPhysics Department\nSchool of VLSI Design & Embedded System\nSchool of Renewal Energy & Efficiency\nSchool of Material Science & Nano Technology\nSchool of Bio Medical Engineering\n\n \n\nROLL SHEET ODD SEMESTER FOR M.TECH 2ND YEAR SESSION 2015-16\n\nCivil Engineering\nMechanical Engineering\nComputer Engineering\nElectrical Engineering\nElectronics & Communication Engineering\nPhysics Department\nSchool of VLSI Design & Embedded System\nSchool of Renewal Energy & Efficiency\nSchool of Material Science & Nano Technology\nSchool of Bio Medical Engineering\n\n \n\nROLL SHEET  ODD SEMESTER FOR M.TECH 2ND YEAR SESSION 2015-16\n\nCivil Engineering\nMechanical Engineering\nComputer Engineering\nElectrical Engineering\nElectronics & Communication Engineering\nPhysics Department\nSchool of VLSI Design & Embedded System\nSchool of Renewal Energy & Efficiency\nSchool of Material Science & Nano Technology\nSchool of Bio Medical Engineering\n\nFINAL ROLL SHEET FOR M.TECH 4TH SEM SESSION 2014-15(EVEN SEM) [W.E.F. 28.04.15)\n\nCivil Engineering\nMechanical Engineering\nComputer Engineering\nElectrical Engineering\nElectronics & Communication Engineering\nPhysics Department\nSchool of VLSI Design & Embedded System\nSchool of Renewal Energy & Efficiency\nSchool of Material Science & Nano Technology\nSchool of Bio Medical Engineering"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/student-services/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/transcript-procedure/",
    "sections": [
      {
        "heading": "Transcript Procedure",
        "content": [
          "Click here to browse the ‘PROCEDURE FOR TRANSCRIPT’",
          "The student(s) who are currently studying or studied any program from the institute (Regional Engineering College, Kurukshetra or National Institute of Technology, Kurukshetra) may request to obtain a transcript either in-person or authorised any other person. They are requested to follow the following process.",
          "Step-1: Download “GENERAL APPLICATION FORM FOR ALL SERVICES” form available on the Institute website under Academic->Student Services->Student Forms.",
          "Step-2: Fill application form in your handwriting and attach the following with this application form.",
          "Prescribed Fee in the form of Demand Draft in Favor of Director, National   Institute of Technology, Kurukshetra, payable at SBI, NIT, Kurukshetra (Branch Code: – 6260) or attach online Proof of Prescribed fee in the main Account of the Institute No. 10116885013 with IFSC No. SBIN0006260.",
          "Rs.100/- 1st set (per page) & Subsequent set @ Rs. 50/- (per page)\n(The set may include photocopies of All Detailed Mark Certificates (DMC) photocopy of Degree/Provisional Degree Certificate (PDC) of both sides without any attestation, Syllabus, World Education Service(WES) Form or such other forms required by the Institute or agencies)",
          "(The set may include photocopies of All Detailed Mark Certificates (DMC) photocopy of Degree/Provisional Degree Certificate (PDC) of both sides without any attestation, Syllabus, World Education Service(WES) Form or such other forms required by the Institute or agencies)",
          "One self-Attested Photocopy of Photo ID Proof issue by the Organization/Government Agencies like Employee ID card, Student ID card, Voter ID card, Aadhar card etc.\n\nOne self-Attested Photocopy of Address proof either in your name or your father name or your spouse name or allotted to you by the organization where you are working.\n\nPhotocopy of Document as a Set for required number of transcripts are as per (1) above.",
          "Step-3: Send all the Documents by Hand/Speed Post and Registered Post at the following address.",
          "Deputy Registrar (Academic)",
          "Room No.: – 210, New Golden Jubilee Administrative Building,",
          "National Institute of Technology, Kurukshetra,",
          "Haryana, India: – 136119",
          "Phone No.: –  01744-233342, 227, 228,",
          "Email ID: – academic@nitkkr.ac.in",
          "Step-4: Normally Transcript is Handed over to the Student within 10-20 working days on receipt of his/her request in the Academic Section.",
          "In case if student couldn’t able to collect the transcript in person then he/she can authorize any present student/faculty to collect his/her transcript on behalf of him/her. In this case he/she has to write a letter with authorizing the person for collection of his/her transcript from academic section under his/her own handwriting and signature, scan the letter and send it by email to academic@nitkkr.ac.in.",
          "Step-5: In case if student has any query in the process he/she may contact in academic section: For UG/PG & Ph.D. Transcript: – 01744-233342",
          "NOTE:",
          "Your suggestion to improve the procedure for getting transcript is always welcomed. You may send your suggestion through email at dr1@nitkkr.ac.in.\nStudents, alumni, visitors, and others are advised to contact Institute authorities for their availability before they plan to come to NIT Kurukshetra for official work.\nThe institute remains open on all working days except Govt Holidays and Weekdays ( Saturdays & Sundays) from 09:00 am to 05:30 pm.\nApproved timings (for students) on working days, as follows: Morning: 12:00 noon to 01:00 pm and Evening: 04:30 pm to 05:30 pm."
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/student-forms/",
    "sections": [
      {
        "heading": "Student Forms",
        "content": [
          "Note:"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/migration-deegre/",
    "sections": [
      {
        "heading": "Procedure for getting Migration and/or Degree",
        "content": [
          "(CLICK HERE FOR DOWNLOAD SAVE AND/OR PRINT)",
          "A student who have studied any program (Alumni) from the Institute (from 26.06.2002 onwards after conversion from Regional Engineering College (REC) to National Institute of Technology (NIT), An Institution of National Repute) may request for obtaining Migration either in-person or by post at their residential address.",
          "All the ex-students of the Institute (REC or NIT) may request for obtaining degree awarded by Kurukshetra University or other University to which REC was affiliated or awarded by NIT, Kurukshetra either in person or by post at their residential address.",
          "They are requested to follow the following process:-",
          "Step-1 :-  Download  “GENERAL APPLICATION FORM FOR ALL SERVICES”  form available on the Institute website under Academic->Student Services->Student Forms.",
          "Step-2:- Fill application form in your handwriting and attach the following with this application form.",
          "Prescribed Fee in the form of Demand Draft in favour of of Director, National Institute of Technology, Kurukshetra, Payable at SBI, NIT, Kurukshetra (Branch Code:- 6260)",
          "The prescribed fee is as per the following: –",
          "Migration Fee = 200 Rs.",
          "Degree Fee = 500 Rs.",
          "Postal Charges =100 Rs (If student want to receive Migration and/or Degree by Speed Post)",
          "Or",
          "Proof of deposition of prescribed fee in the Main Account of the Institute No. 10116885013 with IFSC No. SBIN006260.",
          "Self Attested Photocopy of the “No Dues” certificate of the Institute\nSelf Attested Photocopy of Photo ID Proof issue by the Organization/Government Agencies like Employee ID Card, Student ID Card, Votar ID Card, Aadhar  Card etc\nSelf Attested Photocopy of Address Proof either in your name or your father name or your spouse name or allotted to you by the organization where you are working.",
          "Step-3 Send all the Documents by Speed Post/Registered Post at the following address.",
          "Deputy Registrar (Academic)",
          "Room No.:-210, National Institute of Technology, Kurukshetra",
          "Golden Jubilee Admin Building, Kurukshetra, Haryana, India :-136 119",
          "Phone No. : – 01744-233226, 228",
          "Step-4 Normally Migration/Degree is handed over to the Student within 3-4 working days of receipt of his/her request in Academic Section.",
          "In case if student can’t come to collect the Migration and/or Degree then the same will be sent at his/her address by Speed Post. (As per submitted Address Proof).",
          "Step-5 In case if student has any query in the process he/she may contact on following no in academic section.",
          "For UG Migration and/or Degree :-  01744-233228\nFor PG Migration and/or Degree:- 01744-233226\nFor Ph.D. Migration and/or Degree:- 01744-233229",
          "Your suggestion to improve the procedure for getting Migration and/or Degree is always welcome. You may send your suggestions through email at dr1@nitkkr.ac.in.",
          "NOTE:",
          "-STUDENTS/ALUMNI/VISITORS ARE ADVISED TO CONTACT INSTITUTE AUTHORITIES FOR THEIR AVAILABILITY BEFORE THEY PLAN TO COME TO NIT,KURUKSHETRA FOR OFFICIAL WORK.",
          "-THE INSTITUTE REMAINS OPEN ON ALL WORKING DAYS EXCEPT GOVT HOLIDAYS AND WEEKENDS( SATURDAY AND SUNDAY) FROM 9.00 AM TO 5:30 PM.",
          "– APPROVED STUDENT TIMING ON WORKING DAYS ARE AS FOLLOWS",
          "MORNING : 12:00 NOON TO 01:00 PM",
          "EVENING: 04:30 PM TO 05:30 PM"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/educational-verification/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/academic-programs/",
    "sections": [
      {
        "heading": "Academic Programmes",
        "content": [
          "BTech Programs",
          "MTech Programs",
          "MCA Program",
          "MBA Program",
          "PhD Program"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/trainee-teacher-scheme/",
    "sections": [
      {
        "heading": "Trainee-Teacher Scheme",
        "content": [
          "26-11-14 Trainee-Teacher Scheme Notice (Last date for apply 31-12-14)",
          "Note :-",
          "1. Please note that in this scheme the students who are currently in final year(Batch-2011) or who have passed B.Tech in May/June-2014 (Batch-2010) are only eligible for apply.",
          "2. The students who are in 3rd year(Batch-2012) are not eligible to apply in this scheme this year",
          "Scheme Help Document",
          "Application Form  (Last Date is Over)",
          "Applicant under this scheme please note that the Criteria for selection in the scheme in under process and will be notified in due course of time. Meanwhile they can try to secure their admission in the IITs in M.Tech+Ph.D. programme under this scheme."
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/scholarship-2/",
    "sections": [
      {
        "heading": "Scholarships",
        "content": [
          "National Scholarship Portal (NSP)",
          "National Scholarships Portal is one-stop solution through which various services starting from student application, application receipt, processing, sanction and disbursal of various scholarships to Students are enabled. National Scholarships Portal is taken as Mission Mode Project under National e-Governance Plan (NeGP).",
          "The Mission Mode Project (MMP) of National Scholarships Portal under the National e-Governance Plan aims at providing common electronic portal for implementing various Scholarships schemes launched by Union Government, State Government and Union Territories across the country.",
          "Objectives",
          "Ensure timely disbursement of Scholarships to students\nProvide a common portal for various Scholarships schemes of Central and State Governments\nCreate a transparent database of scholars\nAvoid duplication in processing\nHarmonisation of different Scholarships schemes & norms\nApplication of Direct Benefit Transfer",
          "Various Schemes for all categories (General, OBC, SC, ST, DNT etc.) are run by Central/State Governments on NSP portal like Top Class Education Scheme for SC Students and PM yasasvi central sector scheme of top class education in college for OBC, EBC and DNT students runs by the Ministry of Social Justice and Empowerment.",
          "Students may to visit the NSP Portal https://scholarships.gov.in/for more information regarding procedure to apply for scholarship, eligibility, criteria etc.",
          "Har-Chhatravratti Scholarship (Haryana)",
          "Scholarships are offered to deserving and needy students to encourage them to take up Higher education. This incentive falls in line with the motto of Higher Education of the State: Access, Equity and Quality. Generation makes Nation. Therefore the Govt. of India and Govt. of Haryana are always putting their efforts to attract the students towards Higher Education.",
          "“Har-Chhatravratti” is a centralized portal developed by the Department of Higher Education that provides one stop solution for end-to-end scholarship process right from submission of application, verification and disbursal to end beneficiary. Keeping in view the State Government’s commitment to make beneficiary-oriented schemes easily accessible, seamless and transparent, a centralized State Scholarship Portal has been developed by bringing in 15 scholarship schemes of 7 major department of the government under a single platform.",
          "“Har-Chhatravratti” Portal emerges as one of the most prominent scholarship portal that offers three tier verification of the application. Student Application form got verified from three levels i.e. Institute, University/Nodal Body and Head Office thus ensuring the complete authentication of the applicant. This portal is also integrated with state flagship programme i.e. Parivar Pehchan Patra (PPP) scheme of Haryana Government. In order to avail the benefits of scholarship schemes of the state government, it is mandatory for each applicant to have Parivar Pehchan Patra (PPP). Har-chhatrvratti portal would also include the students of Haryana domicile who are studying outside Haryana. Such application would directly be verified by the concerned department.",
          "Parivar Pehchan Patra (PPP) is mandatory for availing any Scholarship benefit. So Student are advised to make ensure their all particulars such as Name, DOB, Aadhar No. etc are fully updated in PPP before applying for any scholarship scheme.",
          "For PMS-SC and PMS-BC schemes, Students whose family income falls between 1.80 to 2.50 lacs are required to download the Family Income Certificate from the SARAL Portal and upload it while applying for the application form.",
          "For more information, students may visit the Portal https://harchhatravratti.highereduhry.ac.in/",
          "Single Sign On (SSO) Scholarship (Rajasthan)",
          "With the help of the SSO scheme, students could avail of scholarships. To avail of all the benefits of this noble scheme, the residents of Rajasthan can easily apply for this scheme by simple online registration. The SSO ID is a single sign-in ID for accessing everything on the official platform.  Using the SSO ID, one can avail of their labour card, Aadhar card, food security, government farms, etc.",
          "The Rajasthan SSO (Single Sign-On) portal, developed by the state government, allows citizens to access multiple online services through a single platform. By creating an SSO account, individuals can obtain a unique digital identity to access government services. This article provides an in-depth overview of the Rajasthan SSO ID registration process, eligibility requirements, and available web portal services.",
          "For more information, students may visit the Portal https://sso.rajasthan.gov.in",
          "Mukhyamantri Medhavi Vidhyarthi Yojna (MMVY) (Madhya Pradesh)",
          "Mukhyamantri Medhavi Vidyarthi Yojana is a state program run by the Government of Madhya Pradesh. This merit scholarship is available for those who have passed the 12th standard with 70% marks and are currently pursuing a Graduate, Postgraduate or professional courses. The amount of the scholarship varies from course to course and based on the type of college.",
          "For more information, students may visit the Portal https://scholarshipportal.mp.nic.in/",
          "Uttar Pradesh Scholarship",
          "Uttar Pradesh government has launched several scholarship opportunities for the students of the state. Every scholarship has its own set of eligibility criteria that students need to fulfill and be eligible to apply for the scholarship opportunity. One of the key criteria that are applicable for Uttar Pradesh scholarships is to be a permanent resident of Uttar Pradesh (UP) or hold a domicile of UP. Complete information related to other aspects like academic qualifications, family income limit, etc. leads to the successful application of scholarships",
          "For more information, students may visit the Portal https://scholarship.up.gov.in/",
          "Post Matric Bihar Scholarship",
          "The Bihar government launched the Post Matric Scholarship Scheme with the primary goal of assisting and motivating students to pursue higher education. The benefit of the Bihar Post Matric Scholarship is that it offers financial aid, specifically in the form of incentive money, to students who fall under the SC/ST/BC/EBC categories. The Bihar Post Matric Scholarship is a financial assistance program designed to help students from economically disadvantaged families pursue higher education.",
          "The award amount for the Bihar Post Matric Scholarship varies depending on the course and level of study. The scholarship covers tuition fees, maintenance allowance, and other expenses related to the student’s education.",
          "For more information, students may visit the Portal https://www.pmsonline.bih.nic.in/",
          "Prime Ministers Special Scholarship Scheme to J&K Students",
          "PMSSS or Prime Minister’s Special Scholarship Scheme is a financial opportunity offered by the All India Council for Technical Education (AICTE). PMSSS 2023, also known as AICTE JK Scholarship 2023. The aim of PMSSS is to financially assist the students of the Jammu and Kashmir and Ladakh regions",
          "For more information, students may visit the Portal https://www.aicte-india.org/bureaus/jk",
          "Note: –",
          "Notifications of all kind of scholarships will be circulated and uploaded in the Institute through Notice Boards in Departments/Schools/Hostels and on the Institute website respectively.\nIt is mandatory for the student to submit the scholarship form with all supporting documents in Academic Section for further verification and forwarding of application.\nA student can avail only one scholarship in an Academic Year. A student can apply more than one scholarship with the submission of non-selection proof in previous applied scholarship.\nIt is responsibility of the student to inform the academic section regarding the status of availing of scholarship. At later stage, any student found with taking benefits of two scholarships at a time, disciplinary action will be taken as per rule. \nClick here to browse the archived Scholarship notifications"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/scholarship-notifications",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/students-awards-rules/",
    "sections": [
      {
        "heading": "Students Awards",
        "content": [
          "Undergraduate students of B.Tech. Degree Course are eligible for a number of Honours, Awards, Scholarship and other financial assistance based on their academic performance, means, requirements, etc. Chief among these are awards of medals to Toppers in the various disciplines, citation of names in the Institute Roll of Honour and the Award for the Best All Rounder. While the medals and certificates of merit awarded by the university are for purely academic achievements, the Best All Rounder Award is for Students who combine scholarship with sportsmanship and excellence in other extra-mural activities.",
          "University Medal and Merit Certificates for Toppers",
          "The students of Undergraduate Course of B.Tech. Degree Courses, who obtain the highest marks in the final year examination, passing all the semesters in the first attempt are eligible for the award of these University and Merit certificate medals. The names of the toppers who get the highest marks in the final year examination of these disciplines are mentioned in the Insitute Roll of Honours.",
          "Best All-Rounder Award",
          "B.Tech. students passing out of the institute can complete this award which carries a certificate, a cash prize and citation of the name of the winner in the Roll of Honour. Students are selected on the basis of their performance in studies and extra mural activities during the entire period of their stay in the Insitute. Weightage is given to the achievements of a candidate in various fields of activity in accordance with the following distribution:",
          "(i) Academic Performance 50% : Provided that the student should have obtained at least 60 percent marks in all the examinations and must have passed each examination in the first attempt. In case a student does not fulfil this requirement, no marks would be awarded under this sub-head.",
          "(ii) Extra-Curricular Activities :The distribution of these marks shall be as under:",
          "(a) Sports 15%",
          "(b) NCC/NSS 7.5%",
          "(c) Clubs 15%",
          "(d) Student’s Executive 5% Committee",
          "(e) Student Council 2.5%",
          "Marks would be deducted from the above for cases involving indiscipline on the part of the candidate. Students who have been awarded punishment for a major indiscipline would not be eligible for the award of marks under (a) to (e) above. For example, if a student has been expelled from the Institute for any period he/she would be awarded Zero marks in the sub-head (a) to (e). If the score of a candidate under any-head (a) to (e) is less than 40% he/she shall be awarded zero marks under the sub-head.",
          "Best Sportsman Trophy",
          "In order to award the Best Sportsman trophy, the candidates will be awarded marks as follows :",
          "Inter State (National Senior)",
          "Inter State (National Junior)",
          "Inter University",
          "Inter District (National Senior)",
          "Inter District (National Junior) 9 marks 7 marks 5 marks 4 marks 3 marks",
          "Three additional marks for any individual being declared best for any individual event in the State competition subject to the IT) maximum of 6 marks. Two additional marks per event for being declared best for any individual event in the University competition subject to the maximum of 4 marks. One additional mark for being declared best in individual event in the Insti tute/district competition subject to the maximum.of 2 marks. Three additional marks of the Captain University Team. One additional mark for the captain of District/Institute team. Three additional marks to the University Colour.",
          "Students of B.Tech. who get the highest marks in a semester examination are awarded prizes of the value of Rs. 2501- in the form of technical books. Outgoing final year students are awarded this amount in cash.",
          "Provision also exists for a.Second Best Sportsman award with a cash prize of Rs. 2001- and a trophy.",
          "Award for Technical Working model",
          "An award of Rs. 50001- has been instituted from the year 1989-90 for the best technical working model of the year. All students of the Institute are eligible to complete.",
          "General Fitness and Professional Aptitude Marks",
          "Students are encouraged to actively pursure sports, co-curricular activities and social service, to develop their personalities of the full. Their achievements in these fields are reflected in the marks achieved by them in General Fitness and Professional Aptitude. Sixty five marks have been allocated under this head in the scheme of examination for B.Tech. degree course. The distribution of these marks is as follows:",
          "Academic Record 12 marks\nConduct 12 marks\nSports and co-curricular activities 20 marks \nGeneral Impression  15 marks",
          "Marks proportional to the achievements of the students in various fields, shall be awarded to them by the Director at the tie of the final comprehensive vivavoce examination of the end of the VIII semester. Students claiming competitive excellence in any of the activities (Sports/Clubs/Magazine/NSS/NCC, etc.) may apply to the Director for award of marks after having their claims verified by the respective teachers in-charge of the activities in which excellence is claimed. A committee comprising of the President Clubs, President Sports, Staff Editor Institute Magazine and Teacher in-charge NSS assists the Director in shifting the claims of the students and recommends the award of marks to them.",
          "Students who may have indulged in acts of indiscipline or taken part in a I J undesirable activity during their stay in the Insitute will stand to loose marks for I conduct in direct proportion to the severity of offence(s) committed by them.",
          "No marks under this head (conduct) will be awarded to student who have been ‘resticated’ from the Institute.",
          "DR. R.P. SINGH Silver Medal",
          "Silver Medal in the memory of Late Dr. R.P. Singh to be awarded to the toppers in 1 st, 2nd, 3rd year in Mechanical Engineering.",
          "GURU HARKRISHAN, EDUCATIONAL SOCIETY, CHANDIGARH",
          "The society has instituted a prize of Rs. 501/- for the overall topper of all the disciplines of B.Tech. Degree Course.",
          "Haryana State Industrial Development Corporation Ltd.",
          "The Corporation has instituted Merit-cum-Means Scholarship to students belonging to Haryana pursuing engineering courses at the Institute in the disciplines of Civil, Computer and Mechanical Engineering. The scholarship amount of Rs. 500/- per month, for a period of ten months.",
          "MEDALS",
          "Gold Medal alongwith a cash award of Rs. 5,000/- for the students who secure 1st position in the final examination in the above mentioned disciplines of NIT Kurukshetra.",
          "HARYANA STATE ELECTRONICS DEVELOPMENT CORPORATION LTD. CHANDIGARH",
          "The Corporation has instituted Harton Gold, silver and Bronze Medals accompanied by merit certificates and cash prize of Rs. 3000/- Rs. 2000/- and Rs. 1000/- respectively in Institutes in Haryana. in the field of Electronics/Computers.",
          "SHRI SHYAM SUNDER DHINGRA MEDAL",
          "The student of 1981-86 Batch (E) Branch has instituted a Medal along with cash Prize of Rs. 5000/- in the memory of Late Sh. Shyam Sunder Dhingra to be awarded to the top Ranker of B.Tech. CE Branch with effect from 2003."
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/fee-structure/",
    "sections": [
      {
        "heading": "Fee Structure",
        "content": [
          "Click here to browse archived Fee Structure notices."
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/foreign-students/",
    "sections": [
      {
        "heading": "Foreign Students",
        "content": [
          "Note: NIT Surathkal is considering the DASA Admission for the year 2010-11 and 2010-12. Please contact at their website  http://www.nitk.ac.in"
        ]
      },
      {
        "heading": "FEES & DEPOSITS",
        "content": [
          "A) Payable at the time of first enrolment only",
          "B) Annual Charges"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/ccn/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/training-placement-brochure/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/placement-statistics/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/alumni-achievement/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/reck-66-alumni-scholarship/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/minor-degree-courses/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/jobs-nit-kkr/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/awadhesh-kumar-singh/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/mayank-dave/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/sanjay-jain/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/dr-priyanka-ahlawat/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/mohit-dua/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/ritu-garg/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/mantosh-biswas/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/vikram-singh/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/mahendra-kumar-murmu/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/vijay-verma/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/ankit-kumar-jain/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/anoop-kumar-patel/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/santosh-kumar/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/kriti-bhushan/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/bharati-sinha/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/pkumarnitkkr-ac-in/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/skumarnitkkr-ac-in/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/lovkumarnitkkr-ac-in/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/abhilasha-sharma/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/pratishtha-verma/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/vishwasnitkkr-ac-in/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/banhis/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/ssharma/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/vagarwal/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/sweetisah/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/amandeep/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/author/punitk/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/nirf/",
    "sections": [
      {
        "heading": "NIRF (National Institutional Ranking Framework)",
        "content": [
          "For Comments, Feedback and Contact",
          "Other Reports & Data"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/campus-infra/",
    "sections": [
      {
        "heading": "Campus and Infrastructure",
        "content": [
          "Campus : Kurukshetra, steeped in history and mythology, is a place of great spiritual significance, where Lord Krishna, delivered the divine message of “Shrimad Bhagwad Gita”.  The place from where knowledge spread far and wide was chosen as his capital by King Harshwardhana. It is one of the premier centres of pilgrimage attracting devotees in a steady stream all-round the year. Kurukshetra is a railway junction on the Delhi-Karnal-Ambala section of the Northern Railway.  It is about 160 kms. from Delhi.  The Institute campus is about 10 kms. from Pipli, a well known road junction on the Sher Shah Suri Marg and about 5km from Kurukshetra Railway station.",
          "NIT Kurukshetra campus: T The campus extends over an area of 300 acres imaginatively laid down on a picturesque landscape. It presents a spectacle of harmony in architecture and natural beauty. The campus has been organised into three functional sectors: Hostels for the students, Instructional buildings and Residential sector for the staff.",
          "Hostels for students are located towards Eastern side of the campus in the form of cluster. Three storey buildings of hostels provide comfortable accommodation and pleasing environment to students.",
          "National Institute of Technology Kurukshetra (NITK) enjoys the reputation of being a centre of excellence, facilitating quality technical and management education, research and training. It has been confered the status of being an Institution of National Importance.",
          "A Dataquest-IDC-NASSCOM survey placed the institute among the top twenty engineering institutions in the country. The institute scored high on all the parameters such as Placement, Intellectual Capital, Infrastructure, Industry Interface and Recruiter’s Perception. Established in the year 1963, NITK has made rapid strides toward excellence. A sprawling lush green campus, outstanding infrastructure, state-of-the-art support system, contemporary curriculum and a dedicated faculty provide an enabling environment for quality teaching, learning and research. The institute recognizes the significance of Institute-industry Interface and promotes interaction with the industry through student placements, consultancy services, joint research projects and jointly organizing workshops, seminars, conferences, etc. Further strengthening of this bond with the industry is currently a matter of priority for the institute.",
          "Presently, NITK offers undergraduate (B. Tech.) as well as post graduate (M. Tech.) programs in Civil, Computer Science, Electrical, Electronics and Communication, Mechanical Engineering, Industrial Engineering and Management, Information Technology and Master of Business Administration (MBA) – Marketing, Finance, Human Resource Management, Information Technology along with programs in Engineering, Technology, Applied Sciences, and Humanities & Social Sciences at doctorate level. The institute also offers excellent facilities for advanced research in the emerging areas of science and technology. The curriculum is constantly updated to meet the growing demand and needs of the country in different areas of technology and management.",
          "Infrastructure:",
          "The infrastructure is also geared up to enable the institute develop technical personnel of high quality. There are a number of projects that are being carried out by the institute provided by DST, MHRD, CSIR, AICTE and UGC. Teaching and research programs are supported by a central library (with more than one lakh volumes of Books, Bound Journals, IS Codes, Theses, Video CDs etc. The library also has the facility of online journals of IEL, ASCE, ACM, ASME, SAE, IEEE, etc.), an Audio Visual Aid Centre developed under a project of Ministry of Human Resource Development (MHRD). A modern centre for communication and networking has been provided with 24 hours internet facility with a 2Mbps leased line.",
          "NITK looks toward the future with renewed vigor. The institute has recently drawn up a twenty year road map that details strategies to successfully implement the vision of the Institute and effectively meet the challenges of the future. On successfully covering the milestones in the road map, the institute is assured of a place in the forefront of the elite institutes of the country."
        ]
      },
      {
        "heading": "Infrastructure",
        "content": [
          "How to reach:",
          "National Institute of Technology Kurukshetra – 136119 (India)",
          "Telephone No : +91-1744-233212(O)",
          "FAX : +91-1744-238050"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/dean-student-welfare/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/dean-research-and-consultancy/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/deans/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/planning-development/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/about-us-12/",
    "sections": []
  },
  {
    "url": "https://nitkkr.ac.in/patents-technologies/",
    "sections": [
      {
        "heading": "Patents/Technologies",
        "content": [
          "Patents/Technologies granted in the name of NIT, Kurukshetra are listed below:"
        ]
      }
    ]
  },
  {
    "url": "https://nitkkr.ac.in/about-us-11/",
    "sections": []
  }
]